const config = require('./config');

const menuText = (pushname, uptime, speed, usage, mode) => {
    return `┏▣ ◈ 𝐌𝐎𝐌𝐎-𝐗𝐌𝐃 ◈
┃ 𝐎𝐖𝐍𝐄Ր : 𝐌𝐎𝐌𝐎𝟒𝟕
┃ 𝐏𝐋𝐀𝐓𝐅𝐎𝐑𝐌 : ${config.host}
┃ 𝐌𝐎𝐃𝐄 : ${mode}
┃ 𝐕𝐄𝐑𝐒𝐈𝐎𝐍 : 𝟒.𝟕.𝟎
┃ 𝐒𝐏𝐄𝐄𝐃 : ${speed}
┃ 𝐔𝐒𝐀𝐆𝐄 : ${usage}
┗▣

┏▣ ◈ 𝐎𝐖𝐍𝐄𝐑 𝐌𝐄𝐍𝐔 ◈
│➽ 𝐚𝐮𝐭𝐨𝐯𝐢𝐞𝐰𝐬𝐭𝐚𝐭𝐮𝐬
│➽ 𝐚𝐮𝐭𝐨𝐥𝐢𝐤𝐞𝐬𝐭𝐚𝐭𝐮𝐬
│➽ 𝐬𝐞𝐭𝐬𝐭𝐚𝐭𝐮𝐬 𝐞𝐦𝐨𝐣
│➽ 𝐚𝐮𝐭𝐨𝐬𝐚𝐯𝐞𝐬𝐭𝐚𝐭𝐮𝐬
│➽ 𝐫𝐞𝐬𝐭𝐚𝐫𝐭
│➽ 𝐮𝐩𝐝𝐚𝐭𝐞
│➽ 𝐬𝐞𝐭𝐟𝐨𝐧𝐭
│➽ 𝐜𝐡𝐚𝐭𝐛𝐨𝐭
│➽ 𝐚𝐮𝐭𝐨𝐫𝐞𝐜𝐨𝐫𝐝𝐢𝐧𝐠
│➽ 𝐚𝐮𝐭𝐨𝐭𝐲𝐩𝐢𝐧𝐠
│➽ 𝐚𝐥𝐰𝐚𝐲𝐬𝐨𝐧𝐥𝐢𝐧𝐞
│➽ 𝐨𝐰𝐧𝐞𝐫
│➽ 𝐩𝐚𝐢𝐫𝐢𝐧𝐠
│➽ 𝐩𝐢𝐧𝐠
│➽ 𝐫𝐞𝐩𝐨
│➽ 𝐫𝐮𝐧𝐭𝐢𝐦𝐞
│➽ 𝐜𝐡𝐚𝐧𝐧𝐞𝐥
│➽ 𝐦𝐨𝐝𝐞
│➽ 𝐭𝐚𝐠𝐚𝐥𝐥
│➽ 𝐡𝐢𝐝𝐞𝐭𝐚𝐠
┗▣

┏▣ ◈ 𝐆𝐑𝐎𝐔𝐏 𝐌𝐄𝐍𝐔 ◈
│➽ 𝐚𝐝𝐝
│➽ 𝐚𝐧ｔ𝐢𝐥𝐢𝐧𝐤
│➽ 𝐚𝐧𝐭𝐢𝐠𝐫𝐨𝐮𝐩𝐦𝐞𝐧𝐭𝐢𝐨𝐧
│➽ 𝐤𝐢𝐜𝐤
│➽ 𝐩𝐫𝐨𝐦𝐨𝐭𝐞
│➽ 𝐝𝐞𝐦𝐨𝐭𝐞
│➽ 𝐰𝐞𝐥𝐜𝐨𝐦𝐞
│➽ 𝐠𝐨𝐨𝐝𝐛𝐲𝐞
│➽ 𝐨𝐩𝐞𝐧
│➽ 𝐜𝐥𝐨𝐬𝐞
│➽ 𝐚𝐧𝐧𝐨𝐮𝐧𝐜𝐞𝐦𝐞𝐧𝐭𝐬
┗▣

┏▣ ◈ 𝐃𝐎𝐖𝐍𝐋𝐎𝐀𝐃 𝐌𝐄𝐍𝐔 ◈
│➽ 𝐩𝐥𝐚𝐲
│➽ 𝐬𝐨𝐧𝐠
│➽ 𝐯𝐢𝐝𝐞𝐨
│➽ 𝐭𝐢𝐤𝐭𝐨𝚔
┗▣

*𝐏𝐨𝐰𝐞𝐫𝐞𝐝 𝐛𝐲 𝐌𝐎𝐌𝐎-𝐗𝐌𝐃* 🚀

*𝐎𝐰𝐧𝐞𝚛 𝐌𝐎𝐌𝐎𝟒𝟕* ☠️`;
};

module.exports = menuText;
