const config = require('./config');

const menuText = (pushname, uptime, speed, usage, mode) => {
    return `┏▣ ◈ 𝐌𝐎𝐌𝐎-𝐗𝐌𝐃 ◈
┃ 𝐎𝐖𝐍𝐄Ր : 𝐌𝐎𝐌𝐎𝟒𝟕
┃ 𝐏𝐋𝐀𝐓𝐅𝐎𝐑𝐌 : ${config.host}
┃ 𝐌𝐎𝐃Ｅ : ${mode}
┃ 𝐕𝐄𝐑𝐒𝐈𝐎𝐍 : 𝟒.𝟕.𝟎
┃ 𝐒𝐏𝐄𝐄𝐃 : ${speed}
┃ 𝐔𝐒𝐀𝐆𝐄 : ${usage}
┗▣

┏▣ ◈ 𝐎𝐖𝐍𝐄𝐑 𝐌𝐄𝐍𝐔 ◈
│➽ 𝐚𝐮𝐭𝐨𝐯𝐢𝐞𝐰 𝐬𝐭𝐚𝐭𝐮𝐬
│➽ 𝐚𝐮𝐭𝐨𝐥𝐢𝐤𝐞 𝐬𝐭𝐚𝐭𝐮𝐬
│➽ 𝐬𝐞𝐭𝐬𝐭𝐚𝐭𝐮𝐬 𝐞𝐦𝐨𝐣
│➽ 𝐚𝐮𝐭𝐨𝐬𝐚𝐯𝐞𝐬𝐭𝐚𝐭𝐮𝐬
│➽ 𝐫ｅ𝐬𝐭𝐚𝐫𝐭
│➽ 𝐮𝐩𝐝𝐚𝐭𝐞
│➽ 𝐬𝐞𝐭𝐟ｏ𝐧𝐭
│➽ 𝐜𝐡𝐚𝐭𝐛𝐨𝐭
│➽ 𝐚𝐮𝐭𝐨𝐫𝐞𝐜ｏ𝐫𝐝𝐢𝐧𝐠
│➽ 𝐚𝐮𝐭ｏ𝐭𝐲𝐩𝐢𝐧𝐠
│➽ 𝐚𝐥𝐰𝐚𝐲𝐬𝐨𝐧𝐥𝐢𝐧𝐞
│➽ 𝐨𝐰𝐧𝐞𝐫
│➽ 𝐩𝐚𝐢𝐫𝐢𝐧𝐠
│➽ 𝐩𝐢𝐧𝐠
│➽ 𝐫ｅ𝐩𝐨
│➽ 𝐫𝐮𝐧𝐭𝐢𝐦𝐞
│➽ 𝐜𝐡𝐚𝐧𝐧𝐞𝐥
│➽ 𝐦𝐨𝐝𝐞
│➽ 𝐭𝐚𝐠𝐚𝐥𝐥
│➽ 𝐡𝐢𝐝𝐞𝐭𝐚𝐠
┗▣

┏▣ ◈ 𝐆𝐑𝐎𝐔𝐏 𝐌𝐄𝐍𝐔 ◈
│➽ 𝐚𝐝𝐝
│➽ 𝐚𝐧ｔ𝐢𝐥𝐢𝐧ｋ
│➽ 𝐚ｎｔ𝐢𝐠ｒｏｕｐｍｅｎｔ𝐢ｏｎ
│➽ 𝐤𝐢𝐜𝐤
│➽ 𝐩𝐫ｏ𝐦ｏ𝐭𝐞
│➽ 𝐝𝐞ｍｏ𝐭𝐞
│➽ 𝐰𝐞𝐥𝐜ｏ𝐦𝐞
│➽ 𝐠𝐨ｏ𝐝𝐛𝐲𝐞
│➽ 𝐨𝐩𝐞𝐧
│➽ 𝐜𝐥𝐨𝐬𝐞
│➽ 𝐚𝐧𝐧𝐨ｕｎ𝐜𝐞𝐦𝐞ｎｔ𝐬
┗▣

┏▣ ◈ *𝙳𝙾𝚆𝙽𝙻𝙾𝙰𝙳 𝙼𝙴𝙽𝚄* ◈
│➽ *𝚙𝚕𝚊𝚢*
│➽ *𝚜𝚘𝚗𝚐*
│➽ *𝚟𝚒𝚍𝚎𝚘*
│➽ *𝚝𝚒𝚔𝚝𝚘𝚔*
┗▣

*𝙿𝚘𝚠𝚎𝚛𝚎𝚍 𝚋𝚢 𝙼𝙾𝙼𝙾-𝚇𝙼𝙳* 🚀

*𝙾𝚠𝚗𝚎𝚛 𝙼𝙾𝙼𝙾47* ☠️`;
};

module.exports = menuText;
